class MainController < ApplicationController

  def home
    @el_names = ['Вильгельм Стейниц', 'Эмануил Ласкер', 'Хосе-Рауль Капабланка', 'Александр Алехин', 'Макс Эйве', 'Михаил Ботвинник', 'Василий Смыслов', 'Михаил Таль', 'Тигран Петросян', 'Борис Спасский']
    @years_life = %w(1836-1900 1868-1941 1888-1942 1892-1946 1901-1981 1911-1995 1921-2010 1936-1992 1929-1984 1937-н,в,)
    @years_wins = %w(1886-1894 1894-1921 1921-1927 1927-1935,1937-1946 1935-1937 1948-1957,1958-1960,1961-1963 1957-1958 1960-1961 1963-1969 1969-1972)
    @wiki = ['https://ru.wikipedia.org/wiki/Стейниц,_Вильгельм', 'https://ru.wikipedia.org/wiki/Ласкер,_Эмануэль', 'https://ru.wikipedia.org/wiki/Капабланка,_Хосе_Рауль', 'https://ru.wikipedia.org/wiki/Алехин,_Александр_Александрович', 'https://ru.wikipedia.org/wiki/Эйве,_Макс', 'https://ru.wikipedia.org/wiki/Ботвинник,_Михаил_Моисеевич', 'https://ru.wikipedia.org/wiki/Смыслов,_Василий_Васильевич', 'https://ru.wikipedia.org/wiki/Таль,_Михаил_Нехемьевич', 'https://ru.wikipedia.org/wiki/Петросян,_Тигран_Вартанович', 'https://ru.wikipedia.org/wiki/Спасский,_Борис_Васильевич']

    rands = []
    for i in 1..3 do
      r = rand(10)
      while rands.include? r
        r = rand(10)
      end
      rands[rands.length] = r
    end
    @rands = rands
  end

  def game
    @el_names = ['Вильгельм Стейниц', 'Эмануил Ласкер', 'Хосе-Рауль Капабланка', 'Александр Алехин', 'Макс Эйве', 'Михаил Ботвинник', 'Василий Смыслов', 'Михаил Таль', 'Тигран Петросян', 'Борис Спасский']
    @years_life = %w(1836-1900 1868-1941 1888-1942 1892-1946 1901-1981 1911-1995 1921-2010 1936-1992 1929-1984 1937-н,в,)
    @years_wins = %w(1886-1894 1894-1921 1921-1927 1927-1935,1937-1946 1935-1937 1948-1957,1958-1960,1961-1963 1957-1958 1960-1961 1963-1969 1969-1972)

    @sample = @el_names.sample
  end

  def rules

  end

end
